## Welcome to My Jupyter
### Working with Text Data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [7]:
df['Department'].nunique()

35

In [8]:
df.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [10]:
df['Department'] = df['Department'].astype('category')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.2+ KB

### Common String Methodds - .unpper(), .title() and .len()

In [31]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [13]:
'HELLO WORLD'.lower()

'hello world'

In [14]:
'hello world'.upper()

'HELLO WORLD'

In [15]:
'hello world'.title()

'Hello World'

In [16]:
len('hello world')

11

In [17]:
df.head(2)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00

In [21]:
df['Name'].str.lower()

# apply lower() to the Name column

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [22]:
df['Name'].str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [26]:
df['Department'] = df['Department'].str.title()

In [27]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,Water Mgmnt,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,Police,$84450.00
2,"AARON, KARINA",POLICE OFFICER,Police,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,General Services,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,Water Mgmnt,$106836.00

In [32]:
df['Department'].str.len()

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

## The .str.replace() Method

In [34]:
'hellow world'.replace('l','!')

# Here l is replaced with !, we have to replace the  original value with new

'he!!ow wor!d'

In [35]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [36]:
df['Department']

0             WATER MGMNT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4             WATER MGMNT
               ...
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
32062                 NaN
Name: Department, Length: 32063, dtype: category
Categories (35, object): ['ADMIN HEARNG', 'ANIMAL CONTRL', 'AVIATION', 'BOARD OF ELECTION', ..., 'STREETS & SAN', 'TRANSPORTN', 'TREASURER', 'WATER MGMNT']

In [38]:
df['Department'] = df['Department'].str.replace('MGMNT','MANAGMENT')

In [39]:
df.head(6)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGMENT,$106836.00
5,"ABARCA, ANABEL",ASST TO THE ALDERMAN,CITY COUNCIL,$70764.00

In [40]:
df['Employee Annual Salary']

# replace the '$' with nothing

0         $90744.00
1         $84450.00
2         $84450.00
3         $89880.00
4        $106836.00
            ...
32058     $87384.00
32059     $84450.00
32060     $87384.00
32061    $113664.00
32062           NaN
Name: Employee Annual Salary, Length: 32063, dtype: object

In [42]:
df['Employee Annual Salary'].str.replace('$','')
# this is object data type, convert it into float

/var/folders/w3/lxz1zjzs72b6r55gp06_by880000gn/T/ipykernel_1755/2457416446.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Employee Annual Salary'].str.replace('$','')

0         90744.00
1         84450.00
2         84450.00
3         89880.00
4        106836.00
           ...
32058     87384.00
32059     84450.00
32060     87384.00
32061    113664.00
32062          NaN
Name: Employee Annual Salary, Length: 32063, dtype: object

In [50]:
df['Employee Annual Salary'] = df['Employee Annual Salary'].str.replace('$','').astype(float)

/var/folders/w3/lxz1zjzs72b6r55gp06_by880000gn/T/ipykernel_1755/923820002.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Employee Annual Salary'] = df['Employee Annual Salary'].str.replace('$','').astype(float)

In [52]:
df['Employee Annual Salary'].sum()

2571506375.36

In [53]:
df['Employee Annual Salary'].mean()

80204.178633899

In [54]:
df['Employee Annual Salary'].std()

25098.329867510587

In [56]:
df['Employee Annual Salary'].nlargest(5)

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
Name: Employee Annual Salary, dtype: float64

In [57]:
df['Employee Annual Salary'].nsmallest(5)

15102       0.96
12       2756.00
27       2756.00
47       2756.00
295      2756.00
Name: Employee Annual Salary, dtype: float64

## More String Methods - .strip(), .lstrip() and rstrip()

In [58]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [59]:
'     Hello world   '.lstrip()

# lstrip() will remove the blankl space from left side of the word

'Hello world   '

In [60]:
'     Hello world   '.rstrip()
# rstrip() will remove the blankl space from right side of the word

'     Hello world'

In [61]:
'     Hello world   '.strip()
# .strip() method will remove the white space from both side of the word

'Hello world'

In [63]:
df['Name'].str.lstrip()

# removed the white space from the left hand side of the word in the Name column

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [64]:
df['Name'].str.rstrip()

# removed the white space from the right hand side of the word in the Name column

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [66]:
df['Name'] = df['Name'].str.lstrip().str.rstrip()

In [69]:
df['Position Title'] = df['Position Title'].str.strip()

## .strip() will remove the white space from the both side of the word

## String Methods on Index and Columns

In [71]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv',index_col='Name')
df['Department'] = df['Department'].astype('category')
df.head()

# Here we have assigned the Name in row index to perform the row operation

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [73]:
df.index = df.index.str.strip().str.title()

# Now we have to remove the white space from the both hand side 
# after removing the white then make a Sentance with Capital letter of each word

In [74]:
df.index

Index([      'Aaron,  Elvia J',     'Aaron,  Jeffery M',
              'Aaron,  Karina',   'Aaron,  Kimberlei R',
         'Abad Jr,  Vicente M',       'Abarca,  Anabel',
           'Abarca,  Emmanuel',     'Abascal,  Reece E',
        'Abbasi,  Christopher', 'Abbatacola,  Robert J',
       ...
         'Zwolfer,  Matthew W',        'Zych,  Mateusz',
               'Zydek,  Bryan',      'Zygadlo,  John P',
         'Zygadlo,  Michael J',    'Zygowicz,  Peter J',
           'Zymantas,  Mark E',   'Zyrkowski,  Carlo E',
         'Zyskowski,  Dariusz',                     nan],
      dtype='object', name='Name', length=32063)

In [75]:
df.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [77]:
df.columns = df.columns.str.upper()

In [78]:
df.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

## Split String by Characters with .str.split() Methods

In [83]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [81]:
'Hello this is shrishail here'.split(' ')

# The split() method splits a string into a list. 
# You can specify the separator, default separator is any whitespace.

['Hello', 'this', 'is', 'shrishail', 'here']

In [102]:
df['Name'].str.split(',').str.get(0).str.title().value_counts()

# to get the first index of the word, use get() method

Williams     293
Johnson      244
Smith        241
Brown        185
Jones        183
            ...
Horkavy        1
Horn           1
Horne Jr       1
Horner         1
Zyskowski      1
Name: Name, Length: 13829, dtype: int64

In [101]:
df['Position Title'].str.split(' ').str.get(0).value_counts()

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
POOL                 918
FIREFIGHTER          810
                   ...
DENTIST                1
ASSOC                  1
TELEPHONE              1
MAYOR                  1
PREPRESS               1
Name: Position Title, Length: 320, dtype: int64

### More with .split() Methods

In [103]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [106]:
df['Name'].str.split(',')

# Here we want to retriew the last name from Name column

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
32062                       NaN
Name: Name, Length: 32063, dtype: object

In [116]:
df['Name'].str.split(',').str.get(1).str.strip().str.split(' ').str.get(0).value_counts().head()

# Here we get the second name 
# remove the initial as well 
# first we have to remove the white space

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

## The expand and n Parameters of the str.split() Methods

In [117]:
df = pd.read_csv('/Users/ravidonaj/Downloads/All-CSV-ML-Data-Files-Download-master/chicago.csv')
df['Department'] = df['Department'].astype('category')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [122]:
df[['First Name','Last Name']] = df['Name'].str.split(',',expand=True)
# expand will return in the DataFrame

In [123]:
df.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [127]:
df[['First Title World','Remaining Words']] = df['Position Title'].str.split(' ',expand=True,n=1)

# Here we want only one and rest will be in the seconbd column , 
# fro the we need to use limit

In [128]:
df.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,First Title World,Remaining Words
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R,CHIEF,CONTRACT EXPEDITER
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M,CIVIL,ENGINEER IV